# Part 1: pandas 입문

In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

2.3.3

## Series (1차원 배열)
 -생성한 데이터를 pd.Series() 를 통해 판다스전용 1차원배열 즉 Series로 만든다.

In [ ]:
dict_data = {'a': 1, 'b': 2, 'c': 3, 'd': 4}    #딕셔너리(인덱스:값)의 구조로 생성
sr = pd.Series(dict_data)                       #pd.Series()는 판다스의 함수(리스트,딕셔너리 등의 데이터를 넣으면 **판다스 전용 1차원 배열(Series)**로 만들어 줌)
print(sr)                                       # ㄴ sr이라는 곳에 dict_data라는 딕셔너리를 최초에 선언한 import pandas as pd 즉 pandas(줄여서 pd)에 시리즈로 만들어라

print(f"인덱스: {sr.index}")
print(f"값: {sr.values}")
print(f"차원: {sr.ndim}")                       #위와 같은 시리즈는 1차원(한줄로 쭉 나열했기 때문에)    
print(f"형태: {sr.shape}")                      #데이터의 구조를 튜플형태로 출력(1차원(한줄)방향으로 데이터가 있는 갯수)

a    1
b    2
c    3
d    4
dtype: int64
인덱스: Index(['a', 'b', 'c', 'd'], dtype='object')
값: [1 2 3 4]
차원: 1
형태: (4,)

In [7]:
import pandas as pd

### 리스트: 단순한 값의 나열

In [ ]:
seojun_scores_list = [90, 85, 95]       #이렇게만 만들어도 되긴 하지만 값만 있고 인덱스가 없어 이 숫자들이 무엇을 뜻하는 지 알수 없음
print(seojun_scores_list)               # 출력값 : [90, 85, 95]
print(seojun_scores_list[0])            # 출력값 : 90

[90, 85, 95]
90
수학    90
국어    85
영어    95
dtype: int64
90
85
90
85

### pandas Series: 의미있는 데이터

In [ ]:
seojun_scores = pd.Series([90, 85, 95],                     #앞전의 내용처럼 딕셔너리를 만들고 Series로 통째로 변환할 수도 있지만 
                         index=['수학', '국어', '영어'])    #그냥 Series를 선언하면서 한번에 인덱스와 값을 넣어도 동일하게 적용이 된다.
print(seojun_scores)                                        #출력값 : 수학 90 / 국어 85 / 영어 95 (딕셔너리로 넣은 값과 동일하게 출력)

#### 데이터 접근 방식

In [ ]:
print(seojun_scores_list[0])            #맨위에 리스트로 만든것에 0 에 해당하는 값을 출력 - 90
print(seojun_scores_list[1])
print(seojun_scores['수학'])            #Series 를 선언할 때 인덱스, 값을 함께 넣었기 때문에 출력하고자 하는 인덱스의 값을 출력
print(seojun_scores['국어'])            #위의 리스트 출력과 값은 동일하지만 인덱스를 지정했기 때문에 원하는 값을 출력하기에 용이함

#### 데이터 분석 편의성

In [ ]:
total = sum(seojun_scores_list)                 #서준의 점수리스트의 값의 합계를 토탈이라 하기로 한다.
average = total / len(seojun_scores_list)       #토탈값(위에서 지정한 점수의 합계)을 리스트의 갯수로 나눈 값을 에버리지(평균)라 하기로 한다.
print(f"평균: {average}")                       #이와 같이 단순히 리스트로만 두면 하나씩 지정하며 수동으로 계산을 해야함


print(f"평균: {seojun_scores.mean()}")          #하지만 Series로 선언하면 한번에  .mean() .max() 등과 같은 함수들을 사용해 간단하게 출력이 가능하다.
print(f"최고점: {seojun_scores.max()}")
print(f"최고 과목: {seojun_scores.idxmax()}")

평균: 90.0
평균: 90.0
최고점: 95
최고 과목: 영어

#### 조건 필터링

In [ ]:
high_scores_list = []
for i, score in enumerate(seojun_scores_list):              #서준의 스코어리스트에서 점수를 하나씩 확인하는데 그게 몇번째에 들어가있는 점수인지 구해야함(그게 어떤과목의 점수인지 알아야 하기 때문)
    if score >= 90:                                         #매번 꺼내온 리스트 속 점수들을 하나씩 조건(90점이상인가)에 맞나 확인을 해야함
        subjects = ['수학', '국어', '영어']                 #그 점수들이 어떠한 과목인지 알기 위해 과목 리스트를 또 새로 만들어야함
        high_scores_list.append((subjects[i], score))       #위에서 실행한 조건(90점 이상)에 해당한다면 그 값과 방금 새로만든 과목리스트의 값을 짝지어서 저장





high_scores = seojun_scores[seojun_scores >= 90]           #[seojun_scores >= 90] 이 조건 하나로 Series에 들어있는걸 한번에 검사함
print("90점 이상 과목:")                                   #[seojun_scores >= 90]라는 90점이상의 점수를 구해줘 필터를 적용시키고 필터로 걸러낸 값을 high_scores라고 선언한다
print(high_scores)

90점 이상 과목:
수학    90
영어    95
dtype: int64

#### 데이터의 의미

## DataFrame (2차원 배열)
-생성한 데이터를 pd.DataFrame() 을 통해 판다스전용 2차원배열 즉 DataFrame으로 만든다.
 2차원배열에서는 key가 행, value가 열 로 표기되며, 별도의 행 인덱스를 추가해야하고 추가하지 않는다면 인덱스값이 자동으로 출력됨(0,1,2,3...)

In [26]:
exam_data = {
    '이름': ['서준', '우현', '인아', '지우'],
    '수학': [90, 80, 70, 85],
    '영어': [98, 89, 95, 92],
    '음악': [85, 95, 100, 88],
    '체육': [100, 90, 90, 95]
}
df = pd.DataFrame(exam_data)                #2차원은 **판다스 전용 2차원 배열(DataFrame)** 으로 만들어 준다. (위에서 만들어둔 데이터(딕셔너리)가 몇차원인지 알아야 제대로 맞춰서 판다스배열로 변경 가능)
print(df)                                   #데이터프레임에 딕셔너리를 넣으면 딕셔너리의 Key ('이름', '수학', ...)는 가로로 딕셔너리의 Value (['서준', '우현', ...])는 key의 밑에 세로로 출력된다.
                                            #행 인덱스에 해당되는 값이 없기때문에 자동으로 0,1,2,3...을 붙여서 출력이 됨 
                                            #행 인덱스에 값을 넣고 싶다면 이후 별도로 추가해줘야함
print(f"형태: {df.shape}")                  
print(f"열 이름: {df.columns.tolist()}")

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3  지우  85  92   88   95
형태: (4, 5)
열 이름: ['이름', '수학', '영어', '음악', '체육']

# Part 2: 핵심 기능 정리

## 인덱스 활용

#### Series 인덱스

In [27]:
print(sr.index)

print(sr.values)

Index(['a', 'b', 'c', 'd'], dtype='object')
[1 2 3 4]

#### DataFrame 인덱스/열 이름 설정

In [ ]:
data_array = [[90, 98, 85], [80, 89, 95], [70, 95, 100]]
df_custom = pd.DataFrame(data_array,                           #위에서는 행인덱스값이 없어서 0,1,2,3으로 출력이 되었지만, 이번에는 인덱스값을 추가해줬음
                        index=['서준', '우현', '인아'],        #추가한 인덱스[서준,우현,인아]가 각 행의 맨 앞에 출력이 됨
                        columns=['수학', '영어', '음악'])      #data_array라는 리스트에 열 이름(columns)[수학,영어,음악]을 순서대로 매치시켜 추가해줬음
print(df_custom)

    수학  영어   음악
서준  90  98   85
우현  80  89   95
인아  70  95  100

#### 특정 열을 행 인덱스로 설정

In [ ]:
df_indexed = df.set_index('이름')       #기존에 있던 '이름'이라는 열을 인덱스로 선언해서 앞으로는 '이름'이 인덱스가 된다.
print(df_indexed)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
지우  85  92   88   95

#### 행 인덱스 재배열
-기존에 있던 특정(ex'이름')열을 인덱스로 선언하면 앞으로는 열이 아닌 인덱스가 된다.
-인덱스를 재배치하면 인덱스와 연결되어 있던 데이터 행 전체를 새로운 순서에 맞춰서 재배치한다.

In [44]:
import pandas as pd

exam_data = {
    '이름': ['서준', '우현', '인아', '지우'],
    '수학': [90, 80, 70, 85],
    '영어': [98, 89, 95, 92]
}
df = pd.DataFrame(exam_data)
print("1. 원본 DataFrame:")
print(df)

1. 원본 DataFrame:
   이름  수학  영어
0  서준  90  98
1  우현  80  89
2  인아  70  95
3  지우  85  92

In [ ]:
df_indexed = df.set_index('이름')       #.set_index('이름') = 기존에 있던 '이름'이라는 열을 인덱스로 선언해서 앞으로는 '이름'이 인덱스가 된다.
print("\n2. 이름을 인덱스로 설정:")
print(df_indexed)

2. 이름을 인덱스로 설정:
    수학  영어
이름
서준  90  98
우현  80  89
인아  70  95
지우  85  92

In [46]:
df_reindexed = df_indexed.reindex(['우현', '서준', '인아', '지우'])     #reindex() 함수는 인덱스와 연결되어 있던 데이터 행 전체를 새로운 순서에 맞춰서 재배치하는 역할
print("\n3. 인덱스 재배열 후:")
print(df_reindexed)

3. 인덱스 재배열 후:
    수학  영어
이름
우현  80  89
서준  90  98
인아  70  95
지우  85  92

####  행 인덱스를 기준으로 데이터프레임 정렬

In [47]:
df_sorted = df_indexed.sort_index()     #판다스에서 기본값으로 설정된 순서대로 정렬 (오름차순 0-1-2...A-Za-z가-힣)
print(df_sorted)                        #반대로 내림차순으로 정렬하고싶다면 sort_index(ascending=False)를 사용하면 된다.

    수학  영어
이름
서준  90  98
우현  80  89
인아  70  95
지우  85  92

 Part 3: 데이터 조작 기법

# Part 3: 데이터 조작 기법

### 행/열 추가 및 삭제
-데이터를 추가할 때에는 각 행,열에 데이터 갯수에 맞게 추가해야한다.
-데이터를 삭제할 때에는 지우고자 하는 데이터가 행인지 열인지 구분하여 실행해야한다. (axis=0 = 행), (axis=1 = 열)

In [ ]:
df_work = df.copy()                         #변수명 = df 라고만 쓰면 df를 그대로 가져와서 다른이름으로 사용하기때문에 원본도 함께 변경된다.
                                            #따라서 df.copy()를 하여 복사본을 만들어 사용한다.

df_work.loc[4] = ['민지', 88, 94]           #df_work.loc[4] - df_work의 (파이썬숫자)4번째에 해당값을 배정한다.
                                            #위에 df에서 [이름,수학,영어]만 만들어줬기 때문에 그 갯수에 맞춰 값을 넣어야 함

df_work['과학'] = [95, 85, 90, 88, 91]      #이제는 서준~민지 까지 총 5개의 행이 되었으니 그에맞게 5개의 값을 넣어 열을 추가한다.
print(df_work)

   이름  수학  영어  과학
0  서준  90  98  95
1  우현  80  89  85
2  인아  70  95  90
3  지우  85  92  88
4  민지  88  94  91

### 행/열 삭제

In [ ]:
df_dropped_row = df_work.drop(4, axis=0)  #work라는 df에서 인덱스 '4'에 해당되는 행을 drop(삭제)해줘
                                          #앞에 df_dropped_row = 을 붙여줬기 때문에 df_dropped_row에 df_work라는 원본은 보존을 하고
                                          #지정한 행동을 이행한 뒤 남은 값을 df_dropped_row에 저장
display(df_dropped_row)

   이름  수학  영어  과학
0  서준  90  98  95
1  우현  80  89  85
2  인아  70  95  90
3  지우  85  92  88

In [ ]:
df_dropped_col = df_work.drop('과학', axis=1)  #위와 마찬가지로 work라는 df에서 '과학'에 해당되는 열을 drop(삭제)해줘
                                               # axis=0은 행, axis=1은 열

display(df_dropped_col)

   이름  수학  영어
0  서준  90  98
1  우현  80  89
2  인아  70  95
3  지우  85  92
4  민지  88  94

In [56]:
df_multi_drop = df_work.drop([0, 1], axis=0)  # 0, 1번 행 삭제
display(df_multi_drop)

   이름  수학  영어  과학
2  인아  70  95  90
3  지우  85  92  88
4  민지  88  94  91

In [57]:
df_multi_col_drop = df_work.drop(['영어', '과학'], axis=1)  # 여러 열 삭제
display(df_multi_col_drop)

   이름  수학
0  서준  90
1  우현  80
2  인아  70
3  지우  85
4  민지  88

# Part 4: 필터링 기법
-df[df] 혹은 df.query를 사용하여 내가 원하는 조건의 값을 출력해낼 수 있다.

In [59]:
high_math = df[df['수학'] >= 80]                            #df(원본)안에서 '수학'이라는 열에 해당하는 값이 80이상인 데이터만 뽑아서 새로운변수 'high_math'에 저장한다.
display(high_math)


high_both = df[(df['수학'] >= 80) & (df['영어'] >= 90)]     #위와 같은 형태이나 두 조건 사이에 &를 붙여 두 조건이 모두 해당하는 값을 필터링한다.
display(high_both)

   이름  수학  영어
0  서준  90  98
1  우현  80  89
3  지우  85  92

   이름  수학  영어
0  서준  90  98
3  지우  85  92

#### query() 메소드 활용

In [ ]:
result1 = df.query('수학 >= 80')                    #조건(수학 80점 이상인 사람의 값)
display(result1)                                    #기존에는 df[df['수학'] >= 80] 을 썻지만 query로 간단하게 사용할 수 있다.

# 복합 조건
result2 = df.query('수학 >= 80 and 영어 >= 90')     #조건(수학이 80점 이상, 영어가 90점 이상 둘다 해당되는 사람의 값)
display(result2)

# 변수 사용
min_score = 85
result3 = df.query('수학 >= @min_score')            #조건 (min_score = 85 를 지정해줬기 때문에 수학의 점수가 min_score(85)점 이상인 사람의 값)
display(result3)

NameError: name 'df' is not defined

####  isin() 메소드 활용

In [ ]:
# 특정 값들 중 하나라도 포함되는 행 선택
selected_students = df[df['이름'].isin(['서준', '인아'])]   #여기서는 isin을 사용하는 방법을 위해 다시 df[df]를 사용했지만 
                                                            #selected_students = df.query("이름 in ['서준', '인아']") 로 사용해도 된다.
                                                            #selected_students = df.query("이름 == '서준' or 이름 == '인아'") 로도 사용 가능
display(selected_students)

target_scores = [80, 90, 100]
high_scores = df[df['수학'].isin(target_scores)]            #마찬가지로 high_scores = df.query('수학 in @target_scores') 로 변경해서 사용가능하다  
                                                            #위에 @target_scores 가 된 이유는 데이터프레임 속 열의 이름이 아닌 외부에서 선언한 변수명이기때문에
display(high_scores)

   이름  수학  영어
0  서준  90  98
2  인아  70  95

   이름  수학  영어
0  서준  90  98
1  우현  80  89

#  Part 5: 텍스트 처리
- .str.~ = string 즉 문자열 전용 기능을 사용한다는 뜻 (문자열을 처리한다)

#### 텍스트 저장

In [ ]:
fruits = pd.Series(["Apple", "Banana", "Cherry", "Date"], dtype="string")       #여기도 시리즈이지만 행 인덱스가 없기때문에 자동으로 행인덱스가 생성된다.
print(fruits)

0     Apple
1    Banana
2    Cherry
3      Date
dtype: string

#### 문자열 메소드

In [ ]:
print(fruits.str.lower())       #.str.lower = 모든 문자를 소문자로 변경한다.
print(fruits.str.upper())       #.str.upper = 모든 문자를 대문자로 변경한다.

print(fruits.str.len())         #.str.len = 각 문자의 문자열 길이를 표기한다.

names_with_space = pd.Series(["김_철수", "이_영희", "박_민준"])
print(names_with_space.str.split("_"))     #.split("_") = 데이터에 _ 를 기준으로 쪼개서 출력하라

phone_numbers = pd.Series(["010-1234-5678", "011-9876-5432"])
clean_numbers = phone_numbers.str.replace("-", "", regex=False) #.str.replace("-","") = "-" 부분을 ""(빈 문자열) 로 바꿔라. 즉 삭제하라는 뜻
                                                                #regex=False는 정규식 표현이 아니라 글자 그대로의 '-'를 찾아서 바꿔라
print(clean_numbers)

print(fruits.str.contains("a"))     #해당 문자를 포함하는지 여부 (true or false로 출력된다.)
print(fruits.str.contains("A"))

emails = pd.Series(["user1@gmail.com", "user2@naver.com", "user3@daum.net"])
domains = emails.str.extract(r'@([a-zA-Z]+)')   #'@([a-zA-Z]+)' = @뒤에 오는 (a-zA-Z)영어 문자를 출력하는데 (+)반복하여 즉 영어문자가 끝나는 부분까지 모두 가져와라
print(domains)

0     apple
1    banana
2    cherry
3      date
dtype: string
0     APPLE
1    BANANA
2    CHERRY
3      DATE
dtype: string
0    5
1    6
2    6
3    4
dtype: Int64
0    [김, 철수]
1    [이, 영희]
2    [박, 민준]
dtype: object
0    01012345678
1    01198765432
dtype: object
0    False
1     True
2    False
3     True
dtype: boolean
0     True
1    False
2    False
3    False
dtype: boolean
       0
0  gmail
1  naver
2   daum

# 실습 코드 모음

#### 기본 조작

In [ ]:
import pandas as pd

# Series로 생성
dict_data = {'서울': 9720846, '부산': 3404423, '인천': 2947217, '대구': 2427954}
population = pd.Series(dict_data)
display(population)

# DataFrame로 생성
student_data = {
    '학번': [2021001, 2021002, 2021003, 2021004],
    '이름': ['김철수', '이영희', '박민준', '최지원'],
    '전공': ['컴퓨터공학', '경영학', '수학', '물리학'],
    '학년': [3, 2, 4, 1],
    '학점': [3.8, 3.5, 4.2, 3.9]
}
students_df = pd.DataFrame(student_data)
display(students_df)

서울    9720846
부산    3404423
인천    2947217
대구    2427954
dtype: int64

        학번   이름     전공  학년   학점
0  2021001  김철수  컴퓨터공학   3  3.8
1  2021002  이영희    경영학   2  3.5
2  2021003  박민준     수학   4  4.2
3  2021004  최지원    물리학   1  3.9

#### 인덱스 설정

In [ ]:
# 인덱스 재배열
# 학번을 인덱스로
students_indexed = students_df.set_index('학번')
display(students_indexed)

# 내가 지정한 순서대로 재배열
reordered = students_indexed.reindex([2021003, 2021001, 2021004, 2021002])
display(reordered)

# 학점 기준 내림차순
sorted_by_grade = students_indexed.sort_values('학점', ascending=False)     #행 인덱스 재배열 에서 기록해둔것처럼  sort_index(ascending=False)를 사용하면 내림차순이 된다.
display(sorted_by_grade)

          이름     전공  학년   학점
학번
2021001  김철수  컴퓨터공학   3  3.8
2021002  이영희    경영학   2  3.5
2021003  박민준     수학   4  4.2
2021004  최지원    물리학   1  3.9

          이름     전공  학년   학점
학번
2021003  박민준     수학   4  4.2
2021001  김철수  컴퓨터공학   3  3.8
2021004  최지원    물리학   1  3.9
2021002  이영희    경영학   2  3.5

          이름     전공  학년   학점
학번
2021003  박민준     수학   4  4.2
2021004  최지원    물리학   1  3.9
2021001  김철수  컴퓨터공학   3  3.8
2021002  이영희    경영학   2  3.5

#### 데이터 선택 및 필터링

In [ ]:
names = students_df['이름']     #이름 열을 선택하여 해당 열의 값만 출력
display(names)

basic_info = students_df[['이름', '전공', '학점']]  #여러개의 열을 선택하여 출력
display(basic_info)

high_grade = students_df[students_df['학점'] >= 3.7]    #학점이 3.7이상 만 출력
display(high_grade)

senior_good = students_df[(students_df['학년'] >= 3) & (students_df['학점'] >= 3.5)]    #학년이 3학년 이상이고 & 학점이 3.5점 이상 출력
display(senior_good)

cs_students = students_df.query('전공 == "컴퓨터공학" or 전공 == "수학"')   #전공이 "컴퓨터공학" 이거나 "수학" 중 하나라도 해당되면 출력
display(cs_students)

target_majors = ['컴퓨터공학', '물리학']
selected_majors = students_df[students_df['전공'].isin(target_majors)]  #위와 같지만 isin문을 사용하여 students_df속 '전공'에 해당하는 값이 '컴퓨터공학'이거나 '물리학' 에 해당하는 값을 출력
display(selected_majors)

0    김철수
1    이영희
2    박민준
3    최지원
Name: 이름, dtype: object

    이름     전공   학점
0  김철수  컴퓨터공학  3.8
1  이영희    경영학  3.5
2  박민준     수학  4.2
3  최지원    물리학  3.9

        학번   이름     전공  학년   학점
0  2021001  김철수  컴퓨터공학   3  3.8
2  2021003  박민준     수학   4  4.2
3  2021004  최지원    물리학   1  3.9

        학번   이름     전공  학년   학점
0  2021001  김철수  컴퓨터공학   3  3.8
2  2021003  박민준     수학   4  4.2

        학번   이름     전공  학년   학점
0  2021001  김철수  컴퓨터공학   3  3.8
2  2021003  박민준     수학   4  4.2

        학번   이름     전공  학년   학점
0  2021001  김철수  컴퓨터공학   3  3.8
3  2021004  최지원    물리학   1  3.9

#### 실무 활용 예시

In [ ]:
print("=== 학점 통계 ===")
print(f"평균 학점: {students_df['학점'].mean():.2f}")       #.2f 는 소수점 아래 2자리까지 출력하라
print(f"최고 학점: {students_df['학점'].max()}")
print(f"최저 학점: {students_df['학점'].min()}")
print(f"학점 표준편차: {students_df['학점'].std():.2f}")    #std() 는 표준편차라는 판다스의 함수


print("\\n=== 전공별 평균 학점 ===")
major_stats = students_df.groupby('전공')['학점'].agg(['mean', 'count']) #.groupby('전공')['학점'] = 같은'전공'끼리 묶어서 묶인 사람들의 '학점'만 가지고 계산하겠다.
                                                                         # ㄴex) 경영학 전공들의 학점을 계산, 물리학 전공들의 학점을 계산
                                                                         #.agg(['mean', 'count']) = 앞서 지정한 것들로 계산한 mean(평균)과 (count)데이터 갯수를 보여달라.
display(major_stats)

# 학점 등급 부여
def grade_to_letter(grade):
    if grade >= 4.0:
        return 'A'
    elif grade >= 3.5:
        return 'B+'
    elif grade >= 3.0:
        return 'B'
    elif grade >= 2.5:
        return 'C+'
    else:
        return 'C'

students_df['등급'] = students_df['학점'].apply(grade_to_letter)    #students라는 df안에 '등급'이라는 열을 추가하고 위에서 계산한 grade_to_letter값을 넣는다.
display(students_df)                                                #.apply(grade_to_letter) = grade_to_letter의 값을 '학점'의 열에 규칙대로 넣어라.

# 학년별 학생 수
year_count = students_df['학년'].value_counts().sort_index()        #인덱스값이 '학년' 에 해당하는 value_counts(밸류의 갯수)를 이름의 순서대로 (즉 1,2,3... A-Z a-z) 순으로 출력하라
print(f"\\n=== 학년별 학생 수 ===")                                 #sort_index() = 원래대로라면 값이 큰 순서대로 출력하지만 이 함수를 사용하면 인덱스(학년)값의 내림차순으로 출력된다. 
print(year_count)

=== 학점 통계 ===
평균 학점: 3.85
최고 학점: 4.2
최저 학점: 3.5
학점 표준편차: 0.29
\n=== 전공별 평균 학점 ===

       mean  count
전공
경영학     3.5      1
물리학     3.9      1
수학      4.2      1
컴퓨터공학   3.8      1

        학번   이름     전공  학년   학점  등급
0  2021001  김철수  컴퓨터공학   3  3.8  B+
1  2021002  이영희    경영학   2  3.5  B+
2  2021003  박민준     수학   4  4.2   A
3  2021004  최지원    물리학   1  3.9  B+

\n=== 학년별 학생 수 ===
학년
1    1
2    1
3    1
4    1
Name: count, dtype: int64

# 오늘의 미션

## Part 1: 판다스 기초

### 미션 1-1

In [ ]:
import pandas as pd

print(pd.__version__)

2.3.3

### 미션 1-2

In [ ]:
a = {'김철수': 85,'이영희': 92,'박민수': 78,'최지연': 96}
b = pd.Series(a)
print(b)

김철수    85
이영희    92
박민수    78
최지연    96
dtype: int64

### 미션 1-3 (심화)

In [ ]:
print(a['이영희'])

c = b[b >= 90] 
print(c)

d = b + 5
print(d)

92
이영희    92
최지연    96
dtype: int64
김철수     90
이영희     97
박민수     83
최지연    101
dtype: int64

## Part 2: DataFrame 마스터하기

### 미션 2-1

In [ ]:
import pandas as pd

data = {
    '이름': ['김철수', '이영희', '박민수', '최지연'],
    '나이': [20, 19, 21, 20],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 96]
}
df = pd.DataFrame(data)
print(df)

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   성별      4 non-null      object
 3   점수      4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes
None
              나이         점수
count   4.000000   4.000000
mean   20.000000  87.750000
std     0.816497   7.932003
min    19.000000  78.000000
25%    19.750000  83.250000
50%    20.000000  88.500000
75%    20.250000  93.000000
max    21.000000  96.000000
(4, 4)
    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
0    85
1    92
2    78
3    96
Name: 점수, dtype: int64

### 미션 2-2

In [ ]:
print(df.info())
print(df.describe())
print(df.shape)

print(df.head(2))

print(df['점수'])

## Part 3: 데이터 조작과 필터링

### 미션 3-1

In [ ]:
print(df.loc[1])

print(df.iloc[[0, 2], [0, 3]])


age = df[df['나이'] >= 20]
print(age)

이름    이영희
나이     19
성별      여
점수     92
Name: 1, dtype: object
    이름  점수
0  김철수  85
2  박민수  78
    이름  나이 성별  점수
0  김철수  20  남  85
2  박민수  21  남  78
3  최지연  20  여  96

### 미션 3-2

In [ ]:

df.loc[4] = ['정민호', 22, '남자', 88]

df['점수'] += 3
print(df)

    이름  나이  성별  점수
0  김철수  20   남  88
1  이영희  19   여  95
2  박민수  21   남  81
3  최지연  20   여  99
4  정민호  22  남자  91

In [ ]:
def grade(score):
    if score >= 90:
        return 'A'
    elif score >= 80:
        return 'B+'
    else:
        return 'C'

df['등급'] = df['점수'].apply(grade)
display(df)

    이름  나이  성별  점수  등급
0  김철수  20   남  88  B+
1  이영희  19   여  95   A
2  박민수  21   남  81  B+
3  최지연  20   여  99   A
4  정민호  22  남자  91   A

## Part 4: 실전 데이터 분석

In [ ]:
import pandas as pd

# 샘플 데이터 생성
sales_data = {
    '주문번호': ['ORD001', 'ORD002', 'ORD003', 'ORD004', 'ORD005', 'ORD006'],
    '고객명': ['김철수', '이영희', '박민수', '김철수', '최지연', '이영희'],
    '상품명': ['노트북', '마우스', '키보드', '모니터', '노트북', '스피커'],
    '가격': [1200000, 25000, 80000, 300000, 1350000, 120000],
    '수량': [1, 2, 1, 1, 1, 1],
    '주문일': ['2024-01-15', '2024-01-16', '2024-01-16', '2024-01-17', '2024-01-17', '2024-01-18']
}

df_sales = pd.DataFrame(sales_data)

display(df_sales)

     주문번호  고객명  상품명       가격  수량         주문일
0  ORD001  김철수  노트북  1200000   1  2024-01-15
1  ORD002  이영희  마우스    25000   2  2024-01-16
2  ORD003  박민수  키보드    80000   1  2024-01-16
3  ORD004  김철수  모니터   300000   1  2024-01-17
4  ORD005  최지연  노트북  1350000   1  2024-01-17
5  ORD006  이영희  스피커   120000   1  2024-01-18

### 미션 4-1 (종합 프로젝트)

In [ ]:
df_sales['매출액'] = df_sales['가격'] * df_sales['수량']
total = sum(df_sales['매출액'])

print(total)

3100000

In [ ]:
order_counts = df_sales['고객명'].value_counts()
print("고객별 주문 횟수")
print(order_counts)
print()

total_quantity = df_sales.groupby('고객명')['수량'].agg(['sum'])
print("고객별 총 구매금액")
print(customer_sales)

고객별 주문 횟수
고객명
김철수    2
이영희    2
박민수    1
최지연    1
Name: count, dtype: int64

고객별 총 구매금액
고객명
김철수    1500000
박민수      80000
이영희     170000
최지연    1350000
Name: 매출액, dtype: int64

In [ ]:
top = df_sales['상품명'].value_counts()
print(top.index[0])

노트북

In [ ]:
daily_sales = df_sales.groupby('주문일')['매출액'].sum().sort_index()
print(daily_sales)

주문일
2024-01-15    1200000
2024-01-16     130000
2024-01-17    1650000
2024-01-18     120000
Name: 매출액, dtype: int64

In [ ]:
high_sales = df_sales.query("매출액 >= 100000")
print(high_sales)

     주문번호  고객명  상품명       가격  수량         주문일      매출액
0  ORD001  김철수  노트북  1200000   1  2024-01-15  1200000
3  ORD004  김철수  모니터   300000   1  2024-01-17   300000
4  ORD005  최지연  노트북  1350000   1  2024-01-17  1350000
5  ORD006  이영희  스피커   120000   1  2024-01-18   120000

## 심화 미션 1: 결측치 처리

In [ ]:
import numpy as np

# 결측치가 있는 데이터
messy_data = {
    '이름': ['A', 'B', 'C', 'D', 'E'],
    '나이': [25, np.nan, 30, 28, np.nan],
    '점수': [85, 90, np.nan, 95, 88]
}

df_messy = pd.DataFrame(messy_data)

display(df_messy)

  이름    나이    점수
0  A  25.0  85.0
1  B   NaN  90.0
2  C  30.0   NaN
3  D  28.0  95.0
4  E   NaN  88.0

In [ ]:
print(df_messy.isnull()) #df에서 결측치가 있으면 True로 표기하라

      이름     나이     점수
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
4  False   True  False

In [ ]:
age_mean = df_messy['나이'].mean()
df_messy['나이'] = df_messy['나이'].fillna(age_mean)
print(df_messy)

  이름         나이    점수
0  A  25.000000  85.0
1  B  27.666667  90.0
2  C  30.000000   NaN
3  D  28.000000  95.0
4  E  27.666667  88.0

In [ ]:
score = df_messy['점수'].median()
df_messy['점수'] = df_messy['점수'].fillna(score)
print(df_messy)

  이름         나이    점수
0  A  25.000000  85.0
1  B  27.666667  90.0
2  C  30.000000  89.0
3  D  28.000000  95.0
4  E  27.666667  88.0

### 심화 미션 2: 데이터 병합

In [ ]:
# 학생 기본정보
students = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '이름': ['김철수', '이영희', '박민수'],
    '학과': ['컴퓨터공학', '통계학', '경영학']
})

# 학생 성적정보
scores = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '수학': [85, 92, 78],
    '영어': [88, 85, 90]
})

In [ ]:
df_end = pd.merge(students, scores, on='학번')
display(df_end)

     학번   이름     학과  수학  영어
0  S001  김철수  컴퓨터공학  85  88
1  S002  이영희    통계학  92  85
2  S003  박민수    경영학  78  90